docs/Win32_LogicalDisk-3.xml

<?xml version="1.0" encoding="utf-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration">
    <env:Header />
    <env:Body>
        <n:PullReponse>
            <n:Items>
                <p:Win32_LogicalDisk xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wmi/root/cimv2/Win32_LogicalDisk" xmlns:cim="http://schemas.dmtf.org/wbem/wscim/1/common" xsi:type="p:Win32_LogicalDisk_Type">
                    <p:Access>0</p:Access>
                    <p:Availability xsi:nil="true" />
                    <p:BlockSize xsi:nil="true" />
                    <p:Caption>C:</p:Caption>
                    <p:Compressed>false</p:Compressed>
                    <p:ConfigManagerErrorCode xsi:nil="true" />
                    <p:ConfigManagerUserConfig xsi:nil="true" />
                    <p:CreationClassName>Win32_LogicalDisk</p:CreationClassName>
                    <p:Description>Local Fixed Disk</p:Description>
                    <p:DeviceID>C:</p:DeviceID>
                    <p:DriveType>3</p:DriveType>
                    <p:ErrorCleared xsi:nil="true" />
                    <p:ErrorDescription xsi:nil="true" />
                    <p:ErrorMethodology xsi:nil="true" />
                    <p:FileSystem>NTFS</p:FileSystem>
                    <p:FreeSpace>46604288000</p:FreeSpace>
                    <p:InstallDate xsi:nil="true" />
                    <p:LastErrorCode xsi:nil="true" />
                    <p:MaximumComponentLength>255</p:MaximumComponentLength>
                    <p:MediaType>12</p:MediaType>
                    <p:Name>C:</p:Name>
                    <p:NumberOfBlocks xsi:nil="true" />
                    <p:PNPDeviceID xsi:nil="true" />
                    <p:PowerManagementSupported xsi:nil="true" />
                    <p:ProviderName xsi:nil="true" />
                    <p:Purpose xsi:nil="true" />
                    <p:QuotasDisabled>true</p:QuotasDisabled>
                    <p:QuotasIncomplete>false</p:QuotasIncomplete>
                    <p:QuotasRebuilding>false</p:QuotasRebuilding>
                    <p:Size>106837307392</p:Size>
                    <p:Status xsi:nil="true" />
                    <p:StatusInfo xsi:nil="true" />
                    <p:SupportsDiskQuotas>true</p:SupportsDiskQuotas>
                    <p:SupportsFileBasedCompression>true</p:SupportsFileBasedCompression>
                    <p:SystemCreationClassName>Win32_ComputerSystem</p:SystemCreationClassName>
                    <p:SystemName>SMNNOVCTXVDA1</p:SystemName>
                    <p:VolumeDirty>false</p:VolumeDirty>
                    <p:VolumeName />
                    <p:VolumeSerialNumber>1441F0E9</p:VolumeSerialNumber>
                </p:Win32_LogicalDisk>
            </n:Items>
        </n:PullReponse>
    </env:Body>
</env:Envelope>